; domain
(define (domain tour_planner)
    (:requirements :strips :typing :action-costs)

    (:types
        location transport spot - object
    )

    (:predicates
        (at ?transport - transport ?location - location)
        ; (visited_spots ?transport - transport ?spot_no - spot)
        (spot_visiting ?location - location ?spot_no - spot)
        (rating_order ?spot1 ?spot2 - spot)
        (tour_ending_spot ?location - location)
        (moved)
        (food_added)
        
        
    )

    (:functions
        (distance ?location1 ?location2 - location)
        (per_km_cost ?transport - transport)
        (total-cost)
        (transport-cost)
        (food-cost)
        (already_visited)
    )
   
    (:action Enjoying_Location
        :parameters (?t - transport ?l - location ?d ?d_less_one  - spot)
        :precondition (and 
                        (at ?t ?l)
                        (not(tour_ending_spot ?l))
		                (spot_visiting ?l ?d)
		              ;  (visited_spots ?t ?c)
		                (rating_order ?d_less_one ?d)  
		              ;  (rating_order ?c_less_one ?c)
		              )  
        :effect (and 
                (not (spot_visiting ?l ?d))
		        (spot_visiting ?l ?d_less_one)
		      ;  (not (visited_spots ?t ?c))
		      ;  (visited_spots ?t ?c_less_one)
		        (increase (already_visited) 1)
		        )
    )
    
    
    
    
    

    (:action Move_to_Location
        :parameters (?t - transport ?from ?loc - location)
        :precondition (and
                        (not(moved))
                        (not(food_added))
                        (not(tour_ending_spot ?from))
                        (at ?t ?from)
                      )
        :effect (and 
                (not (at ?t ?from))
		        (at ?t ?loc)
		        (increase (total-cost) (* (distance ?from ?loc) (per_km_cost ?t)))
		        (moved)
		        (not(food_added))
                )
    )
    
    (:action add_food_cost
        :parameters (?t - transport ?from - location)
        :precondition (and
                        (moved)
                        (not(food_added))
                        (not(tour_ending_spot ?from))
                        (at ?t ?from)
                      )
        :effect (and 
                ;(not (at ?t ?from))
		        ;(at ?t ?to)
		        (increase (total-cost) (+ (total-cost)(food-cost)))
		        (food_added)
		        (moved)
                )
    )
    
    (:action add_transport_cost
        :parameters (?t - transport ?from  - location)
        :precondition (and
                        (food_added)
                        (moved)
                        (not(tour_ending_spot ?from))
                        (at ?t ?from)
                      )
        :effect (and 
               (not(food_added))
               (not(moved))
                ;(not (at ?t ?from))
		        ;(at ?t ?to)
		        (increase (total-cost) (+ (total-cost) (transport-cost)))
                )
    )

    (:action Get_Back_Home
        :parameters (?t - transport ?l - location)
        :precondition (and
                        (= (already_visited) 10)
                        (at ?t ?l)
                      )
        :effect (and
                (at ?t ?l)
                (tour_ending_spot ?l)
                )
    )
)

; problem
(define (problem linehaul_example)
    (:domain tour_planner)

    (:objects
        TourTravelsBus - transport
        Home Teknaf SaintMartin CoxBazar  - location
        spot0 spot1 spot2 spot3 spot4 spot5 spot6 spot7 spot8 spot9 spot10  - spot
    )

    (:init
        (= (already_visited) 0)
        (at TourTravelsBus Home)
        ; (visited_spots TourTravelsBus spot10)
        (spot_visiting Teknaf spot3)
        (spot_visiting SaintMartin spot5)
        (spot_visiting CoxBazar spot2)
        (rating_order spot0 spot1)
        (rating_order spot1 spot2)
        (rating_order spot2 spot3)
        (rating_order spot3 spot4)
        (rating_order spot4 spot5)
        (rating_order spot5 spot6)
        (rating_order spot6 spot7)
        (rating_order spot7 spot8)
        (rating_order spot8 spot9)
        (rating_order spot9 spot10)
        ; (rating_order n10 n11)
        ; (rating_order n11 n12)
        ; (rating_order n12 n13)
        ; (rating_order n13 n14)
        ; (rating_order n14 n15)
        ; (rating_order n15 n16)
        ; (rating_order n16 n17)
        ; (rating_order n17 n18)
        ; (rating_order n18 n19)
        ; (rating_order n19 n20)
        ; (rating_order n20 n21)
        ; (rating_order n21 n22)
        ; (rating_order n22 n23)
        ; (rating_order n23 n24)
        ; (rating_order n24 n25)
        ; (rating_order n25 n26)
        ; (rating_order n26 n27)
        ; (rating_order n27 n28)
        ; (rating_order n28 n29)
        ; (rating_order n29 n30)
        ; (rating_order n30 n31)
        ; (rating_order n31 n32)
        ; (rating_order n32 n33)
        ; (rating_order n33 n34)
        ; (rating_order n34 n35)
        ; (rating_order n35 n36)
        ; (rating_order n36 n37)
        ; (rating_order n37 n38)
        ; (rating_order n38 n39)
        ; (rating_order n39 n40)
        (= (distance Home Home) 0)
        (= (distance Home Teknaf) 573)
        (= (distance Home SaintMartin) 896)
        (= (distance Home CoxBazar) 876)
        (= (distance Teknaf Home) 573)
        (= (distance Teknaf Teknaf) 0)
        (= (distance Teknaf SaintMartin) 372)
        (= (distance Teknaf CoxBazar) 296)
        (= (distance SaintMartin Home) 896)
        (= (distance SaintMartin Teknaf) 372)
        (= (distance SaintMartin SaintMartin) 0)
        (= (distance SaintMartin CoxBazar) 79)
        (= (distance CoxBazar Home) 876)
        (= (distance CoxBazar Teknaf) 296)
        (= (distance CoxBazar SaintMartin) 79)
        (= (distance CoxBazar CoxBazar) 0)
        (= (per_km_cost TourTravelsBus) 2.59)
        (= (total-cost) 0)
        (= (food-cost) 10)
        (= (transport-cost) 10)
    )

    (:goal (and 
            (= (already_visited) 10)
            (spot_visiting Teknaf spot0)
            (spot_visiting SaintMartin spot0)
            (spot_visiting CoxBazar spot0)
            (at TourTravelsBus Home)
            (tour_ending_spot Home)
           )
	)

    (:metric minimize (total-cost))
)

; plan
1. (move_to_location tourtravelsbus home coxbazar)
   deleted: (at tourtravelsbus home)
   added: (at tourtravelsbus coxbazar) (moved)
   goals met: 0 of 6
2. (enjoying_location tourtravelsbus coxbazar spot2 spot1)
   deleted: (spot_visiting coxbazar spot2)
   added: (spot_visiting coxbazar spot1)
   changed: (already_visited) from 0 to 1
   goals met: 0 of 6
3. (enjoying_location tourtravelsbus coxbazar spot1 spot0)
   deleted: (spot_visiting coxbazar spot1)
   added: (spot_visiting coxbazar spot0)
   changed: (already_visited) from 1 to 2
   goals met: 1 of 6
4. (add_food_cost tourtravelsbus coxbazar)
   added: (food_added)
   goals met: 1 of 6
5. (add_transport_cost tourtravelsbus coxbazar)
   deleted: (food_added) (moved)
   goals met: 1 of 6
6. (move_to_location tourtravelsbus coxbazar teknaf)
   deleted: (at tourtravelsbus coxbazar)
   added: (at tourtravelsbus teknaf) (moved)
   goals met: 1 of 6
7. (enjoying_location tourtravelsbus teknaf spot3 spot2)
   deleted: (spot_visiting teknaf spot3)
   added: (spot_visiting teknaf spot2)
   changed: (already_visited) from 2 to 3
   goals met: 1 of 6
8. (enjoying_location tourtravelsbus teknaf spot2 spot1)
   deleted: (spot_visiting teknaf spot2)
   added: (spot_visiting teknaf spot1)
   changed: (already_visited) from 3 to 4
   goals met: 1 of 6
9. (enjoying_location tourtravelsbus teknaf spot1 spot0)
   deleted: (spot_visiting teknaf spot1)
   added: (spot_visiting teknaf spot0)
   changed: (already_visited) from 4 to 5
   goals met: 2 of 6
10. (add_food_cost tourtravelsbus teknaf)
   added: (food_added)
   goals met: 2 of 6
11. (add_transport_cost tourtravelsbus teknaf)
   deleted: (food_added) (moved)
   goals met: 2 of 6
12. (move_to_location tourtravelsbus teknaf saintmartin)
   deleted: (at tourtravelsbus teknaf)
   added: (at tourtravelsbus saintmartin) (moved)
   goals met: 2 of 6
13. (enjoying_location tourtravelsbus saintmartin spot5 spot4)
   deleted: (spot_visiting saintmartin spot5)
   added: (spot_visiting saintmartin spot4)
   changed: (already_visited) from 5 to 6
   goals met: 2 of 6
14. (enjoying_location tourtravelsbus saintmartin spot4 spot3)
   deleted: (spot_visiting saintmartin spot4)
   added: (spot_visiting saintmartin spot3)
   changed: (already_visited) from 6 to 7
   goals met: 2 of 6
15. (enjoying_location tourtravelsbus saintmartin spot3 spot2)
   deleted: (spot_visiting saintmartin spot3)
   added: (spot_visiting saintmartin spot2)
   changed: (already_visited) from 7 to 8
   goals met: 2 of 6
16. (enjoying_location tourtravelsbus saintmartin spot2 spot1)
   deleted: (spot_visiting saintmartin spot2)
   added: (spot_visiting saintmartin spot1)
   changed: (already_visited) from 8 to 9
   goals met: 2 of 6
17. (enjoying_location tourtravelsbus saintmartin spot1 spot0)
   deleted: (spot_visiting saintmartin spot1)
   added: (spot_visiting saintmartin spot0)
   changed: (already_visited) from 9 to 10
   goals met: 4 of 6
18. (add_food_cost tourtravelsbus saintmartin)
   added: (food_added)
   goals met: 4 of 6
19. (add_transport_cost tourtravelsbus saintmartin)
   deleted: (food_added) (moved)
   goals met: 4 of 6
20. (move_to_location tourtravelsbus saintmartin home)
   deleted: (at tourtravelsbus saintmartin)
   added: (at tourtravelsbus home) (moved)
   goals met: 5 of 6
21. (get_back_home tourtravelsbus home)
   added: (tour_ending_spot home)
   goals met: 6 of 6
